app/controllers/api/v1/greetings_controller.rb

    def index
        @random_greeting = Greeting.order('RANDOM()').first
---
SELECT "greetings".* FROM "greetings" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]